#Вариант 1
str1 = input("Введите строку: ")#запрашиваем ввод строки
i = 0#присваиваем начальному индексу значение 0 
i_e = ""#инициализируем пустую строку для сохранения индексов
while i < len(str1):#используем цикл для перебора символов
    char = str1[i]#извлекаем текущий символ
    if char == 'е':#проверяем равен ли текущий символ букве "е"
        i_e = i_e + str(i) + " "#преобразуем символ в строку и добавляем его в строку
    i = i + 1#увеличиваем индекс для перехода к следующему символу
if i_e:#проверяем не осталась ли строка i_e пустой
    print("Индексы буквы 'е':", i_e)#выводим индексы буквы "е"
else:#другой случай при символе не равном "е"
    print("В строке нет буквы 'е'")#выводим ответ
