str = input("Введите строку на руссеком языке: ")#запрашиваем у пользователя строку 
length = len(str)#проверяем длину строки
vowels = 0#задаем начальное значение гласных символов
consonants = 0#задаем начальное значение согласных символов
vowel_letters = "еиоауыэюяАЕИОУЫЭЮЯ"#инициализируем множество гласных символов
consonant_letters = "бвгджзйклмнпрстфхцчшщъьБВГДЖЗЙККЛМНПРСТФХЦЧШЩЪЬ"#инициализируем множество согласных символов
for char in str:#создаем цикл подсчета согласных и гласных символов
    if char in vowel_letters:#создаем условие гласных символов
        vowels += 1#подсчитываем гласные символы
    elif char in consonant_letters::#создаем условие согласных символов
        consonants += 1#подсчитываем согласные символы
print("Длина строки: ", length)#выводим длину строки
print("Количество гласных символов: ", vowels)#выводим количество гласных символов
print("Количество согласных символов: ", consonants)#выводим количество согласных символов
