#Вариант 1
str1 = input("Введите строку: ")#запрашиваем ввод строки
new_str = ""#инициализируем новую строку
i = 0#присваиваем начальному индексу значение 0 
while i < len(str1):#используем цикл для перебора символов
    char = str1[i]#извлекаем текущий символ
    if char == 'а':#проверяем равен ли текущий символ букве "а"
        new_str = new_str + 'о'#добавляем символ "о"
    else:#другой случай при символе не равном "а"
        new_str = new_str + char#добавляем символ без изменений
    i = i + 1#увеличиваем индекс для перехода к следующему символу
print("Измененная строка: ", new_str)#выводим измененную строку 
